OdGeVector2d.op_Implicit~OdGeMatrix2d
\details
Returns the equivalent 2D tranformation matrix.

OdGeVector2d.set(System.Double,System.Double)
\details
Sets this vector to the specified X and Y coordinates,
and returns a reference to this vector.
\param xx [in]  X-coordinate.
\param yy [in]  Y-coordinate.

OdGeVector2d.largestElement
\details
Returns the index of the largest absolute coordinate of this vector.
\returns
Index of the largest element in the vector.

OdGeVector2d.op_Subscript(System.UInt32)
\details
Returns the ith coordinate of this vector.
\param i [in]  Index of coordinate.
\remarks
* 0 returns the X-coordinate.
* 1 returns the Y-coordinate.
\details
References the ith coordinate of this vector.
\param i [in]  Index of coordinate.
\remarks
* 0 references the X-coordinate.
* 1 references the Y-coordinate.

OdGeVector2d.isEqualTo(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if vector is identical to this vector,
within the specified tolerance.
\param vect [in]  Any 2D vector.
\param tol [in]  Geometric tolerance.

OdGeVector2d.op_Inequality(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator for the OdGeVector2d class.
\param vect [in]   A 2D vector to be compared.
\remarks
Returns true if passed vector is not equal to this vector.

OdGeVector2d.op_Equality(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Equality operator for the OdGeVector2d class.
\param vect [in]   A 2D vector to be compared.
\remarks
Returns true if passed vector is equal to this vector.

OdGeVector2d.crossProduct(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the z value of the cross product of this vector with
the specified vector.
\param vect [in]  Any 2D vector.

OdGeVector2d.dotProduct(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the dot product of this vector and the specified vector.
\param vect [in]  Any 2D vector.

OdGeVector2d.isPerpendicularTo(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGe.ErrorCondition*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified vector is perpendicular to this vector within the specified tolerance.
\param vect [in]  Any 2D vector that is checked to be perpendicular to this vector.
\param tol [in]  Geometric tolerance.
\param status [out]  Receives the status of test.
\remarks
If the length of either vector is > tol, kOk is returned in status.
Possible values for status are as follows:
@untitled table
kOk
k0This
k0Arg1

OdGeVector2d.isPerpendicularTo(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified vector is perpendicular to this vector within the specified tolerance.
\param vect [in]  Any 2D vector that is checked to be perpendicular to this vector.
\param tol [in]  Geometric tolerance.

OdGeVector2d.isCodirectionalTo(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified vector is codirectional to this vector within the specified tolerance.
\param vect [in]  Any 2D vector that is checked to be codirectional with this vector.
\param tol [in]  Geometric tolerance.

OdGeVector2d.isParallelTo(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified vector is parallel to this vector within the specified tolerance.
\param vect [in]  Any 2D vector that is checked to be parallel to this vector.
\param tol [in]  Geometric tolerance.

OdGeVector2d.isZeroLength(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the length of this vector is 0.0 within the specified tolerance.
\param tol [in]  Geometric tolerance.

OdGeVector2d.isUnitLength(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the length of this vector is 1.0 within the specified tolerance.
\param tol [in]  Geometric tolerance.

OdGeVector2d.lengthSqrd
\details
Returns the square of the length of this vector.

OdGeVector2d.length
\details
Returns the length of this vector.

OdGeVector2d.angleToCCW(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the angle from this vector to the specified vector in the counterclockwise direction.
\param vect [in]  Any 2D vector.
\remarks
Returns a value in the range [-OdaPI .. OdaPI].

OdGeVector2d.angleTo(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the angle between this vector and the specified vector.
\param vect [in]  A 2D vector, angle to which is measured.
\remarks
Returns a value in the range [0.0 .. OdaPI].
This function is commutative:
a.angleTo (b) == b.angleTo (a)

OdGeVector2d.angle
\details
Returns the angle between this vector and the X-axis
\remarks
Returns a value in the range [0.0 .. Oda2PI].

OdGeVector2d.perpVector
\details
Returns the vector perpendicular to this one (-y, x).

OdGeVector2d.negate
\details
Negates this vector (-x, -y), and returns a reference to this vector.

OdGeVector2d.op_UnaryNegation
\details
Returns a vector with inverted X and Y coordinates.
\returns
Vector opposite to this vector.

OdGeVector2d.setToSum(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this vector to vector1 + vector1, and returns a reference to this vector.
\param vector1 [in]  Any 2D vector.
\param vector2 [in]  Any 2D vector.

OdGeVector2d.asPoint
\details
Returns this vector as a point.
\details
Returns this vector as a point.

OdGeVector2d.op_SubtractionAssignment(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGeVector2d class.
\param vect [in]   A 2D vector to be subtracted.
\remarks
Subtracts coordinates of the passed vector from the coordinates of this vector and returns a reference to this vector.

OdGeVector2d.op_Subtraction(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGeVector2d class.
\param vect [in]  A 2D vector to be subtracted.
\remarks
Returns a vector that is created by subtracting coordinates of the passed vector from the coordinates of this vector.

OdGeVector2d.op_AdditionAssignment(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Addition operator for the OdGeVector2d class.
\param vect [in]   A 2D vector to be added.
\remarks
Adds coordinates of the specified vector to the coordinates of this vector and returns a reference to this vector.

OdGeVector2d.op_Addition(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Addition operator for the OdGeVector2d class.
\param vect [in]  A 2D vector to be added.
\remarks
Returns a vector that is created by adding coordinates of this vector to the coordinates of the specified vector.

OdGeVector2d.op_DivisionAssignment(System.Double)
\details
Division operator for the OdGeVector2d class.
\param scale [in]  Scale factor.
\remarks
Divides coordinates of this vector by the scale factor and returns reference to this vector.

OdGeVector2d.op_Division(System.Double)
\details
Division operator for the OdGeVector2d class.
\param scale [in]  Scale factor.
\remarks
Returns a vector with divided coordinates of this vector by the scale factor.

OdGeVector2d.op_MultiplicationAssignment(System.Double)
\details
Multiplication operator for the OdGeVector2d class.
\param scale [in]  Scale factor.
\remarks
Multiplies coordinates of this vector by the scale factor and returns reference to this vector.

OdGeVector2d.op_Multiply(System.Double)
\details
Multiplication operator for the OdGeVector2d class.
\param scale [in]  Scale factor.
\remarks
Returns a vector with multiplied coordinates of this vector by the scale factor.

OdGeVector2d.mirror(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Mirrors this vector about the specified 2D line
and returns a reference to this vector.
\param line [in]  Mirror Line.

OdGeVector2d.rotateBy(System.Double)
\details
Rotates this vector the specified angle, and returns
a reference to this vector.
\param angle [in]  Rotation angle.
\remarks
Rotation angle is specified in radians.
Rotation is performed counterclockwise if specified value is positive.

OdGeVector2d.transformBy(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Applies the 2D transformation matrix to this vector,
and returns a reference to this vector.
\param xfm [in]  2D transformation matrix.

OdGeVector2d.setToProduct(OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Sets this vector to the product scale * vect, and returns
a reference to this vector.
\param vect [in]  Any 2D vector.
\param scale [in]  Scale factor.

OdGeVector2d.setToProduct(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this vector to the product matrix * vect and returns
a reference to this vector.
\param matrix [in]  Any 2D matrix.
\param vect [in]  Any 2D vector

OdGeVector2d.#ctor(System.Double,System.Double)
\details
Constructor for the OdGeVector2d class.
\param xx [in]  X-coordinate.
\param yy [in]  Y-coordinate.
\remarks
Constructs a 2D vector with specified X and Y coordinates.

OdGeVector2d.#ctor
\details
Default constructor for the OdGeVector2d class.
\remarks
Constructs a zero-length 2D vector.